wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/qspi_reg.h
#define QSPI_SSCTL_SSACTIEN_Pos          (12)                                              /*!< QSPI_T::SSCTL: SSACTIEN Position       */
#define QSPI_SSCTL_SSACTIEN_Msk          (0x1ul << QSPI_SSCTL_SSACTIEN_Pos)                /*!< QSPI_T::SSCTL: SSACTIEN Mask           */

#define QSPI_SSCTL_SSINAIEN_Pos          (13)                                              /*!< QSPI_T::SSCTL: SSINAIEN Position       */
#define QSPI_SSCTL_SSINAIEN_Msk          (0x1ul << QSPI_SSCTL_SSINAIEN_Pos)                /*!< QSPI_T::SSCTL: SSINAIEN Mask           */

#define QSPI_SSCTL_SLVTOCNT_Pos          (16)                                              /*!< QSPI_T::SSCTL: SLVTOCNT Position       */
#define QSPI_SSCTL_SLVTOCNT_Msk          (0xfffful << QSPI_SSCTL_SLVTOCNT_Pos)             /*!< QSPI_T::SSCTL: SLVTOCNT Mask           */

#define QSPI_PDMACTL_TXPDMAEN_Pos        (0)                                               /*!< QSPI_T::PDMACTL: TXPDMAEN Position     */
#define QSPI_PDMACTL_TXPDMAEN_Msk        (0x1ul << QSPI_PDMACTL_TXPDMAEN_Pos)              /*!< QSPI_T::PDMACTL: TXPDMAEN Mask         */

#define QSPI_PDMACTL_RXPDMAEN_Pos        (1)                                               /*!< QSPI_T::PDMACTL: RXPDMAEN Position     */
#define QSPI_PDMACTL_RXPDMAEN_Msk        (0x1ul << QSPI_PDMACTL_RXPDMAEN_Pos)              /*!< QSPI_T::PDMACTL: RXPDMAEN Mask         */

#define QSPI_PDMACTL_PDMARST_Pos         (2)                                               /*!< QSPI_T::PDMACTL: PDMARST Position      */
#define QSPI_PDMACTL_PDMARST_Msk         (0x1ul << QSPI_PDMACTL_PDMARST_Pos)               /*!< QSPI_T::PDMACTL: PDMARST Mask          */

#define QSPI_FIFOCTL_RXRST_Pos           (0)                                               /*!< QSPI_T::FIFOCTL: RXRST Position        */
#define QSPI_FIFOCTL_RXRST_Msk           (0x1ul << QSPI_FIFOCTL_RXRST_Pos)                 /*!< QSPI_T::FIFOCTL: RXRST Mask            */

#define QSPI_FIFOCTL_TXRST_Pos           (1)                                               /*!< QSPI_T::FIFOCTL: TXRST Position        */
#define QSPI_FIFOCTL_TXRST_Msk           (0x1ul << QSPI_FIFOCTL_TXRST_Pos)                 /*!< QSPI_T::FIFOCTL: TXRST Mask            */

#define QSPI_FIFOCTL_RXTHIEN_Pos         (2)                                               /*!< QSPI_T::FIFOCTL: RXTHIEN Position      */
#define QSPI_FIFOCTL_RXTHIEN_Msk         (0x1ul << QSPI_FIFOCTL_RXTHIEN_Pos)               /*!< QSPI_T::FIFOCTL: RXTHIEN Mask          */

#define QSPI_FIFOCTL_TXTHIEN_Pos         (3)                                               /*!< QSPI_T::FIFOCTL: TXTHIEN Position      */
#define QSPI_FIFOCTL_TXTHIEN_Msk         (0x1ul << QSPI_FIFOCTL_TXTHIEN_Pos)               /*!< QSPI_T::FIFOCTL: TXTHIEN Mask          */

#define QSPI_FIFOCTL_RXTOIEN_Pos         (4)                                               /*!< QSPI_T::FIFOCTL: RXTOIEN Position      */
#define QSPI_FIFOCTL_RXTOIEN_Msk         (0x1ul << QSPI_FIFOCTL_RXTOIEN_Pos)               /*!< QSPI_T::FIFOCTL: RXTOIEN Mask          */

#define QSPI_FIFOCTL_RXOVIEN_Pos         (5)                                               /*!< QSPI_T::FIFOCTL: RXOVIEN Position      */
#define QSPI_FIFOCTL_RXOVIEN_Msk         (0x1ul << QSPI_FIFOCTL_RXOVIEN_Pos)               /*!< QSPI_T::FIFOCTL: RXOVIEN Mask          */

#define QSPI_FIFOCTL_TXUFPOL_Pos         (6)                                               /*!< QSPI_T::FIFOCTL: TXUFPOL Position      */
#define QSPI_FIFOCTL_TXUFPOL_Msk         (0x1ul << QSPI_FIFOCTL_TXUFPOL_Pos)               /*!< QSPI_T::FIFOCTL: TXUFPOL Mask          */

#define QSPI_FIFOCTL_TXUFIEN_Pos         (7)                                               /*!< QSPI_T::FIFOCTL: TXUFIEN Position      */
#define QSPI_FIFOCTL_TXUFIEN_Msk         (0x1ul << QSPI_FIFOCTL_TXUFIEN_Pos)               /*!< QSPI_T::FIFOCTL: TXUFIEN Mask          */

#define QSPI_FIFOCTL_RXFBCLR_Pos         (8)                                               /*!< QSPI_T::FIFOCTL: RXFBCLR Position      */
#define QSPI_FIFOCTL_RXFBCLR_Msk         (0x1ul << QSPI_FIFOCTL_RXFBCLR_Pos)               /*!< QSPI_T::FIFOCTL: RXFBCLR Mask          */

#define QSPI_FIFOCTL_TXFBCLR_Pos         (9)                                               /*!< QSPI_T::FIFOCTL: TXFBCLR Position      */
#define QSPI_FIFOCTL_TXFBCLR_Msk         (0x1ul << QSPI_FIFOCTL_TXFBCLR_Pos)               /*!< QSPI_T::FIFOCTL: TXFBCLR Mask          */

#define QSPI_FIFOCTL_SLVBERX_Pos         (10)                                              /*!< QSPI_T::FIFOCTL: SLVBERX Position      */
#define QSPI_FIFOCTL_SLVBERX_Msk         (0x1ul << QSPI_FIFOCTL_SLVBERX_Pos)               /*!< QSPI_T::FIFOCTL: SLVBERX Mask          */

#define QSPI_FIFOCTL_RXTH_Pos            (24)                                              /*!< QSPI_T::FIFOCTL: RXTH Position         */
#define QSPI_FIFOCTL_RXTH_Msk            (0x7ul << QSPI_FIFOCTL_RXTH_Pos)                  /*!< QSPI_T::FIFOCTL: RXTH Mask             */

#define QSPI_FIFOCTL_TXTH_Pos            (28)                                              /*!< QSPI_T::FIFOCTL: TXTH Position         */
#define QSPI_FIFOCTL_TXTH_Msk            (0x7ul << QSPI_FIFOCTL_TXTH_Pos)                  /*!< QSPI_T::FIFOCTL: TXTH Mask             */

#define QSPI_STATUS_BUSY_Pos             (0)                                               /*!< QSPI_T::STATUS: BUSY Position          */
#define QSPI_STATUS_BUSY_Msk             (0x1ul << QSPI_STATUS_BUSY_Pos)                   /*!< QSPI_T::STATUS: BUSY Mask              */

#define QSPI_STATUS_UNITIF_Pos           (1)                                               /*!< QSPI_T::STATUS: UNITIF Position        */
#define QSPI_STATUS_UNITIF_Msk           (0x1ul << QSPI_STATUS_UNITIF_Pos)                 /*!< QSPI_T::STATUS: UNITIF Mask            */

#define QSPI_STATUS_SSACTIF_Pos          (2)                                               /*!< QSPI_T::STATUS: SSACTIF Position       */
#define QSPI_STATUS_SSACTIF_Msk          (0x1ul << QSPI_STATUS_SSACTIF_Pos)                /*!< QSPI_T::STATUS: SSACTIF Mask           */

#define QSPI_STATUS_SSINAIF_Pos          (3)                                               /*!< QSPI_T::STATUS: SSINAIF Position       */
#define QSPI_STATUS_SSINAIF_Msk          (0x1ul << QSPI_STATUS_SSINAIF_Pos)                /*!< QSPI_T::STATUS: SSINAIF Mask           */

#define QSPI_STATUS_SSLINE_Pos           (4)                                               /*!< QSPI_T::STATUS: SSLINE Position        */
#define QSPI_STATUS_SSLINE_Msk           (0x1ul << QSPI_STATUS_SSLINE_Pos)                 /*!< QSPI_T::STATUS: SSLINE Mask            */

#define QSPI_STATUS_SLVTOIF_Pos          (5)                                               /*!< QSPI_T::STATUS: SLVTOIF Position       */
#define QSPI_STATUS_SLVTOIF_Msk          (0x1ul << QSPI_STATUS_SLVTOIF_Pos)                /*!< QSPI_T::STATUS: SLVTOIF Mask           */

